import React from "react";
import "../Styles/Content.css";

export default function About() {
  return (
    <div className="body">
      <div className="content">
        <h1>About</h1>

        <p>
          108學年，我以社會學系學生的身份來到了台大。
          <br />
          方才進入台大，便展開了一段思想不斷激盪、衝擊的旅程。
          <br />
          無論是社會學所講究的，從結構與環境影響個人抑或是各式各樣對傳統價值觀的挑戰：性別、酷兒、貧窮、醫療關係、勞資衝突。都一再撼動我過往所認為的台灣社會的樣子，也讓我見到事實上，社會並沒有那麼美好——或者只是作為高中生所見到的世界能夠如此純粹。
          <br />
          不過除了這些特別嚴肅且悲傷的話題之外，我們依然也學到了有關於組織架構——韋伯的科層體制理論等，抑或是在選修課所習得的，從社會學的觀點看待當今企業的管理，並以員工為出發點思考的管理方法，還有群眾外包、非典型勞動等管理相關概念。這些也都幫助即便是在社會科學院學習的我，也可以接觸到有關於組織，以及管理的基本概念。也可以透過自己刻細的出發點來思考管理手法的弊病與影響。
          <br />
          除此之外，社會學系所帶有的應用統計以及研究方法的訓練，也幫助我習得使用統計工具的能力，也可以進行設計問卷，處理資料並撰寫研究報告等工作。
          <br />
          <br />
          109學年，我首次接觸到寫程式，當時修習圖資系所開設的程式設計課程，並從
          Java 入門，經過一個學期之後，已經可以撰寫基本的與使用者互動之程式。
          <br />
          隨後為了確定自己的興趣及挑戰自己，去資工系修習了資料結構與演算法。然而，對程式語言（Ｃ）的不熟悉以及數學基礎的缺乏，導致在寫程式時需要花費較多時間，在時間複雜度的推導也感受到了相當的問題。隨時間推進，總算是克服了對Ｃ語言不熟悉的問題，不過對數學的能力依舊提升不彰，這也使得我確定自己該藉由學習線性代數提升自己對數學工具的認識以及數理邏輯的培養。儘管當時的修課帶給我不少挫折，但我仍舊喜歡寫程式，我開始一個一個補回那些過去沒有學好的知識，並且開始慢慢寫
          LeetCode，以訓練自己用資料結構或演算法來解決題目。
          <br />
          <br />
          這時我也才發現，即便曾經一再感到挫折，只要肯不放棄堅持到最後，那些經驗也都一一成為自己成長的養分——無論是思考或是程式碼撰寫都比半年前更加敏捷。這也為我下一個學期對
          Python 的學習打下足夠好的基礎。
          <br />
          <br />
          2020學年，也是一個對我未來規劃最大衝擊的時期。算是為了準備修習由經濟系所主導的「資料分析與社會研究跨域專長」，我回過頭來修習由資管系所開設的商管程式設計。Python
          對從 Java 入門，並且被 C
          語言鍛鍊過的我來說算是比較容易。在理解課程內容以及作業撰寫比較順利，過去所學習的知識也幫助我可以盡量優化自己的程式碼。而在期末專案中，自己得以順利建立一個較為完整的專案
          GenoMaker，並且彌補其他組員實力不足的缺陷。我也在課程的休息中，通過孔令傑老師的介紹學到程式如何在管理中發揮作用，以及在萬事達卡來這裡分享時萌發對資料科學的好奇心。
          <br />
          在下學期，我才終於確立自己想到資管所學習的志向，我想尋求更多的鍛鍊，不但想對資料科學有更近一步的學習，也想利用這個過程繼續鍛鍊自己的
          Programming
          Skill。這也促使我進一步的去學習資管系相關的知識，並以學習線性代數作為出發點，開始一步一步學習資管系所該具備的基本知識與素養。並且將在下一學習開始一一補上資管系的必修科目。
        </p>

        <h2>程式方面經歷：</h2>

        <ol>
          <li>
            修習兩門程式設計課，分別為兩種程式語言（Java、Python），皆有專案開發經驗。其中
            Python 曾用於開發本地程式，而正在以 Java
            作為後端程式語言開發網頁型網路程式。
          </li>
          <li>
            修習資料結構與演算法，以 C 語言實作部分經典的資料結構與演算法。
          </li>
          <li>
            參加社會模擬工作坊，於工作坊內競賽中以程式實作個人行為模式的模型，加以預測在不同條件下個體的行為模式，以及在社會情境中引發的結果。獲得該競賽第一名。
          </li>
        </ol>
      </div>
    </div>
  );
}
